Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.RemoveAt Method
 Removes the element at the specified index from the collection.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RemoveAt(
	int Index
)
Public Sub RemoveAt (
	Index As Integer
)
Parameters
Index
Type: System.Int32
The index of the item to remove.
Implements
IList<T>.RemoveAt(Int32)
Exceptions
Exception | Condition
ArgumentException | Thrown when the supplied index is out of bounds.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace